In [7]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
%sql mysql+pymysql://root:easwari@localhost

In [9]:
%%sql
use `joins`;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [10]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
19 rows affected.

[('customers',),
 ('departments',),
 ('employees',),
 ('employees1',),
 ('employees2',),
 ('employees3',),
 ('employees_most_recent_salaries',),
 ('numbers',),
 ('numbers2',),
 ('orders',),
 ('productdelivery',),
 ('products',),
 ('regions',),
 ('salaries',),
 ('students',),
 ('table-a',),
 ('table-b',),
 ('table1',),
 ('table2',)]

In [6]:
%%sql
select id from table1;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1,), (2,), (3,), (None,), (5,)]

In [9]:
%%sql
select id, ifnull(id,0) as `null handling` 
from table1;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 1), (2, 2), (3, 3), (None, 0), (5, 5)]

In [10]:
%%sql
select id, ifnull(id,(select avg(id) from table1)) as `null handling` 
from table1;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, Decimal('1.0000')),
 (2, Decimal('2.0000')),
 (3, Decimal('3.0000')),
 (None, Decimal('2.7500')),
 (5, Decimal('5.0000'))]

In [11]:
%%sql
select id, round(ifnull(id,(select avg(id) from table1))) as `null handling` 
from table1;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, Decimal('1')),
 (2, Decimal('2')),
 (3, Decimal('3')),
 (None, Decimal('3')),
 (5, Decimal('5'))]

In [13]:
%%sql
CREATE TABLE employees3 (
    employee_id INT,
    name VARCHAR(50),
    department VARCHAR(50),
    salary DECIMAL(10, 2)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [15]:
%%sql
INSERT INTO employees3 (employee_id, name, department, salary) VALUES
(1, 'Jaanu', 'HR', 5000.00),
(2, 'Lavanya', 'Sales', NULL),
(3, 'Dakshith', NULL, 4500.00),
(4, 'Janani', 'IT', 7000.00),
(5, 'Lakshith', NULL, NULL);

 * mysql+pymysql://root:***@localhost
5 rows affected.

[]

In [16]:
%%sql
select * from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Jaanu', 'HR', Decimal('5000.00')),
 (2, 'Lavanya', 'Sales', None),
 (3, 'Dakshith', None, Decimal('4500.00')),
 (4, 'Janani', 'IT', Decimal('7000.00')),
 (5, 'Lakshith', None, None)]

In [19]:
%%sql
select name,department,coalesce(department,'no data') as `null handling` 
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('Jaanu', 'HR', 'HR'),
 ('Lavanya', 'Sales', 'Sales'),
 ('Dakshith', None, 'no data'),
 ('Janani', 'IT', 'IT'),
 ('Lakshith', None, 'no data')]

In [22]:
%%sql
select name,department,coalesce(department,name) as `null handling` 
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('Jaanu', 'HR', 'HR'),
 ('Lavanya', 'Sales', 'Sales'),
 ('Dakshith', None, 'Dakshith'),
 ('Janani', 'IT', 'IT'),
 ('Lakshith', None, 'Lakshith')]

In [25]:
%%sql
select *,
coalesce(salary,department,name) as `null handling` 
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Jaanu', 'HR', Decimal('5000.00'), '5000.00'),
 (2, 'Lavanya', 'Sales', None, 'Sales'),
 (3, 'Dakshith', None, Decimal('4500.00'), '4500.00'),
 (4, 'Janani', 'IT', Decimal('7000.00'), '7000.00'),
 (5, 'Lakshith', None, None, 'Lakshith')]

In [12]:
%%sql
select * from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Jaanu', 'HR', Decimal('5000.00')),
 (2, 'Lavanya', 'Sales', None),
 (3, 'Dakshith', None, Decimal('4500.00')),
 (4, 'Janani', 'IT', Decimal('7000.00')),
 (5, 'Lakshith', None, None)]

In [13]:
%%sql
select department
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('HR',), ('Sales',), (None,), ('IT',), (None,)]

In [15]:
%%sql
select department, ifnull(department, 'no department') as `new_department`
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('HR', 'HR'),
 ('Sales', 'Sales'),
 (None, 'no department'),
 ('IT', 'IT'),
 (None, 'no department')]

In [26]:
%%sql
select *,
ifnull(salary,department) as `ifnull`,
coalesce(salary,department,name) as `coalesce`
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Jaanu', 'HR', Decimal('5000.00'), '5000.00', '5000.00'),
 (2, 'Lavanya', 'Sales', None, 'Sales', 'Sales'),
 (3, 'Dakshith', None, Decimal('4500.00'), '4500.00', '4500.00'),
 (4, 'Janani', 'IT', Decimal('7000.00'), '7000.00', '7000.00'),
 (5, 'Lakshith', None, None, None, 'Lakshith')]

In [16]:
%%sql
select salary
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(Decimal('5000.00'),),
 (None,),
 (Decimal('4500.00'),),
 (Decimal('7000.00'),),
 (None,)]

--> if any (null values) in salary (replace) it with  its (average) of the salary column

In [23]:
%%sql
(select avg(salary) from employees3);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(Decimal('5500.000000'),)]

In [22]:
%%sql
select salary, 
ifnull(salary, (select avg(salary) from employees3)) as `new_salary`,
round(ifnull(salary, (select avg(salary) from employees3))) as `new_sal_2`
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(Decimal('5000.00'), Decimal('5000.000000'), Decimal('5000')),
 (None, Decimal('5500.000000'), Decimal('5500')),
 (Decimal('4500.00'), Decimal('4500.000000'), Decimal('4500')),
 (Decimal('7000.00'), Decimal('7000.000000'), Decimal('7000')),
 (None, Decimal('5500.000000'), Decimal('5500'))]

--> coalese()

In [28]:
%%sql
select *, 
coalesce(salary,department,name) as `coalesce`
from employees3;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Jaanu', 'HR', Decimal('5000.00'), '5000.00'),
 (2, 'Lavanya', 'Sales', None, 'Sales'),
 (3, 'Dakshith', None, Decimal('4500.00'), '4500.00'),
 (4, 'Janani', 'IT', Decimal('7000.00'), '7000.00'),
 (5, 'Lakshith', None, None, 'Lakshith')]